In [16]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import plotly
import plotly.express as px
import openpyxl

In [17]:
#Подгружаем данные из файла Excel
data_parsing = pd.read_excel('data/Data_TSUM.xlsx', sheet_name='Data_Parsing')
data_company = pd.read_excel('data/Data_TSUM.xlsx', sheet_name='Data_Company')

In [18]:
#Проверка работоспособности и корректности первого листа
display(data_parsing.head())
display(data_parsing.tail())

       brand Category   producer_id producer_color  price
0  Valentino    Shoes  aaaaa1111_11          black    167
1  Valentino    Shoes  aaaaa1111_12          black    188
2  Valentino    Shoes  aaaaa1111_13          black    184
3  Valentino    Shoes  aaaaa1111_14        bla//ck    196
4  Valentino    Shoes  aaaaa1111_15        bla\\ck    250

           brand Category   producer_id producer_color  price
70  Stone Island     Bags  sssss1111_31         ~~~red    164
71  Stone Island     Bags  sssss1111_32         ~~~red    158
72  Stone Island     Bags  sssss1111_33         ~~~red    194
73  Stone Island     Bags  sssss1111_34         ~~~red    256
74  Stone Island     Bags  sssss1111_35         ~~~red    205

In [39]:
#Проверка работоспособности и корректности второго листа
display(data_company.head())
display(data_company.tail())

       brand Category      item_id color_id  current price
0  Valentino    Shoes  aaaaa111111    black            247
1  Valentino    Shoes  aaaaa111112    black            161
2  Valentino    Shoes  aaaaa111113    black            234
3  Valentino    Shoes  aaaaa111114    black            167
4  Valentino    Shoes  aaaaa111115    black            153

           brand Category      item_id color_id  current price
70  Stone Island     Bags  sssss111131      red            165
71  Stone Island     Bags  sssss111132      red            196
72  Stone Island     Bags  sssss111133      red            236
73  Stone Island     Bags  sssss111134      red            222
74  Stone Island     Bags  sssss111135      red            275

In [40]:
#Подтсягивание к базе парсинга данных из базы компании
data_parsing['item_id'] = data_company['item_id']
data_parsing['color_id'] = data_company['color_id']
data_parsing['current_price'] = data_company['current price']
display(data_parsing.head())
display(data_parsing.tail())

,brand,Category,producer_id,producer_color,price,item_id,color_id,current_price,difference_price_%
0,Valentino,Shoes,aaaaa1111_11,black,167,aaaaa111111,black,247,67.6
1,Valentino,Shoes,aaaaa1111_12,black,188,aaaaa111112,black,161,116.8
2,Valentino,Shoes,aaaaa1111_13,black,184,aaaaa111113,black,234,78.6
3,Valentino,Shoes,aaaaa1111_14,bla//ck,196,aaaaa111114,black,167,117.4
4,Valentino,Shoes,aaaaa1111_15,bla\\ck,250,aaaaa111115,black,153,163.4

,brand,Category,producer_id,producer_color,price,item_id,color_id,current_price,difference_price_%
70,Stone Island,Bags,sssss1111_31,~~~red,164,sssss111131,red,165,99.4
71,Stone Island,Bags,sssss1111_32,~~~red,158,sssss111132,red,196,80.6
72,Stone Island,Bags,sssss1111_33,~~~red,194,sssss111133,red,236,82.2
73,Stone Island,Bags,sssss1111_34,~~~red,256,sssss111134,red,222,115.3
74,Stone Island,Bags,sssss1111_35,~~~red,205,sssss111135,red,275,74.5

In [46]:
#Формирование столбца разницы цен в % (Цена конкурента к нашей цене)
data_parsing['difference_price_%'] = round(((data_parsing['price']-data_parsing['current_price'])/data_parsing['current_price'])*100, 2)
display(data_parsing.head())
display(data_parsing.tail())

,brand,Category,producer_id,producer_color,price,item_id,color_id,current_price,difference_price_%
0,Valentino,Shoes,aaaaa1111_11,black,167,aaaaa111111,black,247,-32.39
1,Valentino,Shoes,aaaaa1111_12,black,188,aaaaa111112,black,161,16.77
2,Valentino,Shoes,aaaaa1111_13,black,184,aaaaa111113,black,234,-21.37
3,Valentino,Shoes,aaaaa1111_14,bla//ck,196,aaaaa111114,black,167,17.37
4,Valentino,Shoes,aaaaa1111_15,bla\\ck,250,aaaaa111115,black,153,63.40

,brand,Category,producer_id,producer_color,price,item_id,color_id,current_price,difference_price_%
70,Stone Island,Bags,sssss1111_31,~~~red,164,sssss111131,red,165,-0.61
71,Stone Island,Bags,sssss1111_32,~~~red,158,sssss111132,red,196,-19.39
72,Stone Island,Bags,sssss1111_33,~~~red,194,sssss111133,red,236,-17.80
73,Stone Island,Bags,sssss1111_34,~~~red,256,sssss111134,red,222,15.32
74,Stone Island,Bags,sssss1111_35,~~~red,205,sssss111135,red,275,-25.45

In [ ]:
#Построение гистограммы для выявления выбросов
fig = px.histogram(
    data_frame=data_parsing,
    x='difference_price_%',
    
)